---
kind: type
id: T:Autodesk.Revit.DB.BeamSystemType
source: html/6b42bef4-e54f-db0c-ce13-a097213fbc4f.htm
---
# Autodesk.Revit.DB.BeamSystemType

An object that specifies the type of a beam system in Autodesk Revit.

## Syntax (C#)
```csharp
public class BeamSystemType : ElementType
```